dongfangqing/OWL-IOT32V2/user/RTL8710_driver/RTL8710_driver.c
/*********************************OWL-IOT32*********************************                                      
 
	                         \\\|///
                       \\  - -  //
                        (  @ @  )
+---------------------oOOo-(_)-oOOo-------------------------+
|                                                           |
|                             Oooo                          |
+-----------------------oooO--(   )-------------------------+
                       (   )   ) /
                        \ (   (_/
                         \_)           
***************************************************************************/
#include "RTL8710_driver.h"
#include "usart_driver.h"
#include "ST_string.h"
#include "SysTick.h"

#include <stdlib.h>


#ifdef USART1_DEBUG

#define WIFI_DEBUG_INFO

#endif

/*********************************************
**函数功能：向RTL8710发送AT指令
**********************************************/
void WIFI_RTL8710_Send_data(uint8_t* str)
{
	Usart2_Sendstr(str) ;
}




/**********************************************************
**函数功能:毫秒延时
***********************************************************/
static void WIFI_RTL8710_Delay_ms(uint16_t ms)
{
	delay_ms(ms);
}

/**********************************************************
**函数功能:向BLE模组发送字符串
***********************************************************/
static int WIFI_RTL8710_SendStr(unsigned char* str)
{
	return Usart2_Sendstr(str) ;
}



/**********************************************************
**函数功能:情况存储空间buff和重置管道WIFI_RTL8710_pipe
***********************************************************/
static void WIFI_RTL8710_ReSetBuff(void)
{
	Clear_USART_Buff(USART2_BUF);
	pipe_init(&WIFI_RTL8710_pipe, (uint8_t *)WIFI_MEM_BUFF,WIFI_MEM_BUFF_SIZE);
}

/**********************************************************
**函数功能:读取AT指令发送后返回的值
***********************************************************/
void WIFI_RTL8710_ReadReturn(unsigned char* buf)
{
	pipe_read(&WIFI_RTL8710_pipe, &buf[0]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[1]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[2]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[3]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[4]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[5]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[6]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[7]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[8]);
	pipe_read(&WIFI_RTL8710_pipe, &buf[9]);
}

/**********************************************************
**函数功能:BLE模组返回值比较
***********************************************************/
static uint8_t WIFI_RTL8710_RetString_Compare(unsigned char* buf)
{
	uint16_t i = 0;
	
	for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
	{
		if((buf[i] == 'O')&&(buf[i+1] == 'K'))
		{
			return WIFI_SUCCESS;
		}
	}

	return WIFI_ERROR;
}

/**********************************************************
**函数功能:测试WIFI 模组 AT 指令启动
**返回	值:WIFI_SUCCESS-----BLE  模组 AT指令启动成功
**				WIFI_ERROR-------BLE模组 AT指令启动失败
***********************************************************/
uint8_t WIFI_RTL8710_Test_Startup(void)
{
//	uint8_t buf[10] = {0};

	
	WIFI_RTL8710_ReSetBuff();
	printf("WIFI_RTL8710_Test_Startup\r\n");
	
	if(WIFI_RTL8710_SendStr("AT\r\n") == st_strlen("AT\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
//		WIFI_RTL8710_ReadReturn( buf);
//		printf("WIFI buf: %s\r\n  len = %d\r\n",buf,st_strlen(buf));
//		printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",Usart2_buff,st_strlen(Usart2_buff));

		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}

#ifdef WIFI_DEBUG_INFO
	printf("WIFI AT cmd Error!\r\n");
#endif

	return WIFI_ERROR;
}


/*********************************************************
**函数功能：WIFI模块重启
**********************************************************/
void WIFI_RTL8710_Reboot(void)
{
	WIFI_RTL8710_ReSetBuff();
	
	if(WIFI_RTL8710_SendStr("ATSR\r\n") == st_strlen("ATSR\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return;
		}
	}

#ifdef WIFI_DEBUG_INFO
	printf("WIFI AT cmd Error!\r\n");
#endif
}


/*************************************************************
**函数功能：设置模组进入省电电源模式
**参		数:OPEN_OS_WAKELOCK-----//打开操作系统锁(系统禁止睡眠)
**				UNLOCK_OS_WAKELOCK---//解除操作系统睡眠锁(系统允许睡眠)
**				GET_OS_SLEEP_STATUS---//获取操作系统睡眠锁状态
**返回	值：当参数为OPEN_OS_WAKELOCK/UNLOCK_OS_WAKELOCK时
**				    WIFI_SUCCESS------设置成功
**				    WIFI_ERROR------设置失败
**返回	值：当参数为GET_OS_SLEEP_STATUS时
**				    '1'------OPEN_OS_WAKELOCK模式
**				    '0'------UNLOCK_OS_WAKELOCK模式
**************************************************************/
uint8_t WIFI_RTL8710_Set_Sleep(uint8_t param)
{
	uint8_t buf[36] = "ATSP=";

	WIFI_RTL8710_ReSetBuff();
	
	if(param == OPEN_OS_WAKELOCK)
	{
		st_strcat(buf,"a");
		st_strcat(buf,"\r\n");
		
		if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
		{
			WIFI_RTL8710_Delay_ms(100);
			if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
			{
				#ifdef WIFI_DEBUG_INFO
				printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
				printf("WIFI AT cmd Success!\r\n");
				#endif
				return WIFI_SUCCESS;
			}
		}
	}
	else if(param == UNLOCK_OS_WAKELOCK)
	{
		st_strcat(buf,"r");
		st_strcat(buf,"\r\n");

		if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
		{
			WIFI_RTL8710_Delay_ms(100);
			if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
			{
				#ifdef WIFI_DEBUG_INFO
				printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
				printf("WIFI AT cmd Success!\r\n");
				#endif
				return WIFI_SUCCESS;
			}
		}
	}
	else if(param == GET_OS_SLEEP_STATUS)
	{
		uint16_t i = 0;
		
		st_strcat(buf,"?");
		st_strcat(buf,"\r\n");
	
		for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
		{
			if((buf[i] == '[')&&(buf[i+1] == 'A')&&(buf[i+2] == 'T')&&(buf[i+3] == 'S')&&(buf[i+4] == 'P')
				&&(buf[i+5] == ']')&&(buf[i+6] == ' '))
			{
				return buf[i+7];
			}
		}
	}

	return WIFI_ERROR;
}

