dongfangqing/OWL-IOT32V2/user/RTL8710_driver/RTL8710_driver.c
/*************************************************************
**函数功能：设置串口是否打印AT指令
**参		数:	AT_PRINT_ENABLE---启用串口打印AT指令
**				AT_PRINT_DISABLE--禁用串口打印AT指令
**返回	值：WIFI_SUCCESS------设置成功
**				    WIFI_ERROR--------设置失败
**************************************************************/
uint8_t WIFI_RTL8710_Set_AT_Print(uint8_t param)
{
	uint8_t buf[36] = "ATSE=";

	WIFI_RTL8710_ReSetBuff();
	
	if(param == AT_PRINT_ENABLE)
	{
		st_strcat(buf,"1");
		st_strcat(buf,"\r\n");
	}
	else if(param == AT_PRINT_DISABLE)
	{
		st_strcat(buf,"0");
		st_strcat(buf,"\r\n");
	}

	if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}

	return WIFI_ERROR;
}

/**********************************************************
**函数功能:WIFI模组恢复默认
***********************************************************/
uint8_t WIFI_RTL8710_RestoreDefault(void)
{
	WIFI_RTL8710_ReSetBuff();
	
	if(WIFI_RTL8710_SendStr("ATSY\r\n") == st_strlen("ATSY\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}

	return WIFI_ERROR;
}

/**********************************************************
**函数功能:波特率的设置
**参		数:"2400" "4800"  "9600" "19200" "38400" "57600"
**				"74800" "115200"
***********************************************************/
uint8_t WIFI_RTL8710_Set_BaudRate(unsigned char* baudrate)
{
	uint8_t str_buf[30] = "ATSU=";
	uint8_t buf[] = ",8,1,0,0,1\r\n";

	if(baudrate == NULL)
		return WIFI_ERROR;

	st_strcat(str_buf,baudrate);
	st_strcat(str_buf,buf);

	WIFI_RTL8710_ReSetBuff();
	
	if(WIFI_RTL8710_SendStr(str_buf) == st_strlen(str_buf))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}

	return WIFI_ERROR;
}

/***********************************************
**函数功能：设置WiFi的工作模式 AP--STA--APSTA
************************************************/
uint8_t Set_RTL8710_Work_mode(WIFIWork_Mode mode)
{
	uint8_t str_buf[30] = "ATPW=" ;
	
	WIFI_RTL8710_ReSetBuff();
	
	switch(mode)
	{
		case WIFI_MODE_AP:
			st_strcat(str_buf,"2\r\n");
			
			//ATPA=<ssid>,<pwd>,<chl>,<hidden>
			WIFI_RTL8710_Send_data("ATPA=OWLunio,123456,11,0\r\n");
			break;
		case WIFI_MODE_STA:
			st_strcat(str_buf,"1\r\n");
			break;
		case WIFI_MODE_APSTA:
			st_strcat(str_buf,"3\r\n");
			WIFI_RTL8710_Send_data("ATPA=OWL-IOT32,123456,11,0\r\n");
			break;
	}

	if(WIFI_RTL8710_SendStr(str_buf) == st_strlen(str_buf))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			if(mode == WIFI_MODE_STA)
				return WIFI_SUCCESS;
		}
		else return WIFI_ERROR;
	}

	if((mode == WIFI_MODE_AP)||(mode == WIFI_MODE_APSTA))
	{
		WIFI_RTL8710_ReSetBuff();
		if(WIFI_RTL8710_SendStr("ATPA=OWLunio,123456,11,0\r\n") == st_strlen("ATPA=OWLunio,123456,11,0\r\n"))
		{
			WIFI_RTL8710_Delay_ms(100);
			if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
			{
				#ifdef WIFI_DEBUG_INFO
				printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
				printf("WIFI AT cmd Success!\r\n");
				#endif
				return WIFI_SUCCESS;
			}
		}
	}

	return WIFI_ERROR;
}


/*******************************************************************
**函数功能：连接AP
********************************************************************/
uint8_t WIFI_RTL8710_Connect_AP(uint8_t* ssid,uint8_t* passwd)
{
	uint8_t buf[50] = "ATPN=";
	
	st_strcat(buf,ssid);
	st_strcat(buf,",");
	st_strcat(buf,passwd);
	st_strcat(buf,"\r\n");
#ifdef WIFI_DEBUG_INFO	
	printf("Send: %s\r\n",buf);
#endif	
	
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
	{
		uint8_t i = 0;
		for(i = 0;i < 10;i++)
			WIFI_RTL8710_Delay_ms(1000);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
		else	//还未连接成功,再连接一次
		{
			for(i = 0;i < 20;i++)
				WIFI_RTL8710_Delay_ms(1000);
			if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
			{
				#ifdef WIFI_DEBUG_INFO
				printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
				printf("WIFI AT cmd Success!\r\n");
				#endif
				return WIFI_SUCCESS;
			}
		}
	}

	return WIFI_ERROR;
}


/*******************************************************************
**函数功能：断开连接AP
********************************************************************/
uint8_t WIFI_RTL8710_NotConnect_AP(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATWD\r\n") == st_strlen("ATWD\r\n"))
	{
			WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}


/****************************************************************
**函数功能：WIFI扫描周边路由器
*****************************************************************/
uint8_t WIFI_RTL8710_Scan_Router(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATWS\r\n") == st_strlen("ATWS\r\n"))
	{
		uint8_t i = 0;
		for(i = 0;i < 10;i++)
			WIFI_RTL8710_Delay_ms(1000);
//		if(WIFI_RTL8710_RetString_Compare(WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/*******************************************************************
**函数功能：设置启动时自动连接AP
********************************************************************/
uint8_t WIFI_RTL8710_Auto_Connect(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPG=1\r\n") == st_strlen("ATPG=1\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/*******************************************************************
**函数功能：STA模式下,为模组配置静态IP
**ip_addr--------IP地址
**gateway_mask---格式 "192.168.1.1,255.255.255.0"
********************************************************************/
uint8_t WIFI_RTL8710_Setup_StaticIP(uint8_t* ip_addr,uint8_t* gateway_mask)
{	
	uint8_t buf[50] = "ATPE=";
	
	st_strcat(buf,ip_addr);
	st_strcat(buf,",");
	st_strcat(buf,gateway_mask);
	st_strcat(buf,"\r\n");
	//ATPE=<ip>(,<gateway>,<mask>)
//	WIFI_RTL8710_Send_data("ATPE=192.168.1.254,192.168.1.1,255.255.255.0");
#ifdef WIFI_DEBUG_INFO	
	printf("Send: %s\r\n",buf);
#endif
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}


/*******************************************************************
**函数功能：SmartConfig配置WiFi
********************************************************************/
uint8_t WIFI_RTL8710_SmartConfig_Setup_Connect(void)
{
	printf("WIFI_RTL8710_SmartConfig_Setup_Connect!\r\n");
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATWQ\r\n") == st_strlen("ATWQ\r\n"))
	{
		WIFI_RTL8710_Delay_ms(1000);
		
//		#ifdef WIFI_DEBUG_INFO
//		printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
//		printf("WIFI AT cmd Success!\r\n");
//		#endif
		{
			uint16_t i = 0;
	
			for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
			{
				if((WIFI_MEM_BUFF[i] == 'A')&&(WIFI_MEM_BUFF[i+1] == 'T')&&
					(WIFI_MEM_BUFF[i+2] == 'W')&&(WIFI_MEM_BUFF[i+3] == 'Q'))
				{
					#ifdef WIFI_DEBUG_INFO
					printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
					printf("WIFI AT cmd Success!\r\n");
					#endif
					return WIFI_SUCCESS;
				}
			}
		}
	}
	return WIFI_ERROR;
}

/****************************************************************
**函数功能：关闭所有连接
*****************************************************************/
uint8_t WIFI_RTL8710_CloseAll_Connection(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPD=0\r\n") == st_strlen("ATPD=0\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/****************************************************************
**函数功能：使能透传模式
*****************************************************************/
uint8_t WIFI_RTL8710_Enable_TransparentTransmission_mode(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPU=1\r\n") == st_strlen("ATPU=1\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/****************************************************************
**函数功能：进入传输模式
*****************************************************************/
uint8_t WIFI_RTL8710_Enter_Transmission_mode(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPT\r\n") == st_strlen("ATPT\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/****************************************************************
**函数功能：保存配置信息到flash
*****************************************************************/
uint8_t WIFI_RTL8710_Save_info_To_Flash(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPL=1\r\n") == st_strlen("ATPL=1\r\n"))
	{
		WIFI_RTL8710_Delay_ms(100);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}


