dongfangqing/OWL-IOT32V2/user/RTL8710_driver/RTL8710_driver.c
/*************************************************************
**函数功能：配置WIFI RTL8710为TCP客户端模式
**参	数：IP_Addr------指针指向服务器端口号和IP地址
**			格式：42.62.41.209,04002
**返回	值：成功
**************************************************************/
uint8_t WIFI_RTL8710_Set_TCPClient_Mode(uint8_t* IP_Addr)
{
	uint8_t buf[36] = "ATPC=0,";
	
	st_strcat(buf,IP_Addr);
	st_strcat(buf,"\r\n");
#ifdef WIFI_DEBUG_INFO	
	printf("Send: %s\r\n",buf);
#endif

	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
	{
		uint8_t i = 0;
		for(i = 0;i < 10;i++)
			WIFI_RTL8710_Delay_ms(1000);
		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
		else	//再等待一段时间
		{
			for(i = 0;i < 20;i++)
				WIFI_RTL8710_Delay_ms(1000);
			if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
			{
				#ifdef WIFI_DEBUG_INFO
				printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
				printf("WIFI AT cmd Success!\r\n");
				#endif
				return WIFI_SUCCESS;
			}
		}
	}
	return WIFI_ERROR;
}


/*************************************************************
**函数功能：检测网络连接状态
**返回	值：WIFI_ERROR------连接失败
**				    WIFI_SUCCESS------连接成功
**************************************************************/
uint8_t WIFI_RTL8710_Check_NetWork_Status(void)
{
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATPI\r\n") == st_strlen("ATPI\r\n"))
	{
			WIFI_RTL8710_Delay_ms(100);
//		if(WIFI_RTL8710_RetString_Compare(WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}

/*************************************************************
**函数功能：通过ping验证网络连接
**参	数：IP_Addr------IP地址
**			格式：192.168.1.1
**返回	值：成功
**************************************************************/
uint8_t WIFI_RTL8710_Ping(uint8_t* IP_Addr)
{
	uint8_t buf[36] = "ATPP=";
	
	st_strcat(buf,IP_Addr);
	st_strcat(buf,"\r\n");
#ifdef WIFI_DEBUG_INFO	
	printf("Send: %s\r\n",buf);
#endif

	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr(buf) == st_strlen(buf))
	{
		uint8_t i = 0;
		for(i = 0;i < 10;i++)
			WIFI_RTL8710_Delay_ms(1000);
//		if(WIFI_RTL8710_RetString_Compare((uint8_t *)WIFI_MEM_BUFF) == WIFI_SUCCESS)
		{
			#ifdef WIFI_DEBUG_INFO
			printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
			printf("WIFI AT cmd Success!\r\n");
			#endif
			return WIFI_SUCCESS;
		}
	}
	return WIFI_ERROR;
}



/**********************************************************
**函数功能：WIFI 引脚接口定义，初始化
**CHIP_EN--------------PB9
***********************************************************/
void WIFI_RTL8710_Port_GPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); 

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_ResetBits(GPIOB, GPIO_Pin_9);
}

/*********************************************************
**函数功能：WIFI模块使能
**********************************************************/
void WIFI_RTL8710_Enable(void)
{
	GPIO_SetBits(GPIOB, GPIO_Pin_9);
}

/*********************************************************
**函数功能：WIFI模块使能
**********************************************************/
void WIFI_RTL8710_Disable(void)
{
	GPIO_ResetBits(GPIOB, GPIO_Pin_9);
}


/*
**函数功能:获取WiFi连接的信息
Wifi信息的显示为：wifi模式，SSID,频道，安全模式，（wep秘钥ID）,密码, 设备mac地址, 设备IP, 网关
STA,TP-LINK_dfq,1,AES,wrw112358,00:09:30:98:d6:1d,192.168.1.107,192.168.1.1

[ATW?] OK
*/
uint8_t Read_wifi_Connect_Info(WIFI_CONNECT_INFO* info)
{
	uint16_t i = 0;
	uint8_t ret = WIFI_ERROR;
	uint8_t flags = WIFI_ERROR;
	
	if(info == NULL)
		return WIFI_ERROR;
	
	for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
	{
		if((WIFI_MEM_BUFF[i] == 'O')&&(WIFI_MEM_BUFF[i+1] == 'K'))
		{
			flags = WIFI_SUCCESS;
			break;
		}
	}
	if(flags != WIFI_SUCCESS)
	{
		return WIFI_ERROR;
	}
	
	{
		uint8_t num = 0;
		uint8_t j = 0;
		uint8_t count = 0;
		
		st_memset((unsigned char*)info,0,sizeof(WIFI_CONNECT_INFO));
		//STA,TP-LINK_dfq,1,AES,wrw112358,00:09:30:98:d6:1d,192.168.1.107,192.168.1.1
		//get ap ssid
		for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
		{
			if(WIFI_MEM_BUFF[i] == ',')
			{
				num++;
			}
			else continue;
			
			switch(num)
			{
				case 1:	//ap ssid
					count = 0;
					for(j = i+1;j < i+1+40;j++)
					{
						if(WIFI_MEM_BUFF[j] != ',')
						{
							info->ap_ssdi[count] = WIFI_MEM_BUFF[j];
							count++;
						}
						else if(WIFI_MEM_BUFF[j] == ',')
							break;
					}
					break;
				case 2: break;
				case 3: break;
				case 4:	//ap password
					count = 0;
					for(j = i+1;j < i+1+40;j++)
					{
						if(WIFI_MEM_BUFF[j] != ',')
						{
							info->ap_password[count] = WIFI_MEM_BUFF[j];
							count++;
						}
						else if(WIFI_MEM_BUFF[j] == ',')
							break;
					}
					break;
				case 5:	//MAC addr
					count = 0;
					for(j = i+1;j < i+1+18;j++)
					{
						if(WIFI_MEM_BUFF[j] != ',')
						{
							info->mac_addr[count] = WIFI_MEM_BUFF[j];
							count++;
						}
						else if(WIFI_MEM_BUFF[j] == ',')
							break;
					}
					break;
				case 6:	//ipaddr
					count = 0;
					for(j = i+1;j < i+1+16;j++)
					{
						if(WIFI_MEM_BUFF[j] != ',')
						{
							info->ipaddr[count] = WIFI_MEM_BUFF[j];
							count++;
						}
						else if(WIFI_MEM_BUFF[j] == ',')
							break;
					}
					break;
				case 7:	//gatewayip
					{
						uint8_t back = 0;
						
						count = 0;
						for(j = i+1;j < i+1+16;j++)
						{
							
							info->gatewayip[count] = WIFI_MEM_BUFF[j];
							count++;
							if(back == 3)
								break;
							if(WIFI_MEM_BUFF[j] == '.')
							{
								back++;
							}
						}
					}
					
					ret = WIFI_SUCCESS;
					break;
			}
			
			if(ret == WIFI_SUCCESS)
				break;
		}
	}
	
	return ret;
}
/*******************************************************************
**函数功能：查询WiFi当前连接信息
********************************************************************/
uint8_t WIFI_RTL8710_Info(WIFI_CONNECT_INFO* info)
{
	#ifdef WIFI_DEBUG_INFO
	printf("WIFI_RTL8710_Info!\r\n");
	#endif
	WIFI_RTL8710_ReSetBuff();
	if(WIFI_RTL8710_SendStr("ATW?\r\n") == st_strlen("ATW?\r\n"))
	{
		WIFI_RTL8710_Delay_ms(1000);
		WIFI_RTL8710_Delay_ms(1000);

		{
			uint16_t i = 0;
	
			for(i = 0;i < WIFI_MEM_BUFF_SIZE;i++)
			{
				if((WIFI_MEM_BUFF[i] == 'O')&&(WIFI_MEM_BUFF[i+1] == 'K'))
				{
					#ifdef WIFI_DEBUG_INFO
					printf("WIFI Usart2_buff: \r\n%s\r\n  len = %d\r\n",(uint8_t *)WIFI_MEM_BUFF,st_strlen((uint8_t *)WIFI_MEM_BUFF));
					printf("WIFI AT cmd Success!\r\n");
					#endif
					
					return Read_wifi_Connect_Info(info);
//					return WIFI_SUCCESS;
				}
			}
		}
	}
	return WIFI_ERROR;
}


/****************************************************************
**函数功能：WIFI模块初始化
*****************************************************************/
void WIFI_RTL8710_Startup(void)
{
	WIFI_RTL8710_Port_GPIO_Init();
	WIFI_RTL8710_Enable();
}

