dongfangqing/OWL-IOT32V2/user/RTL8710_driver/RTL8710_driver.c
uint8_t wifi_pipe_enable = 0;
Pipe_t WIFI_RTL8710_pipe;
WIFI_CONNECT_INFO wifi_info;
/****************************************************************
**函数功能：WIFI模块初始化
*****************************************************************/
void WIFI_RTL8710_Init(void)
{
	printf("WIFI_RTL8710_Init()!!\r\n");
	

	//初始化管道
	pipe_init(&WIFI_RTL8710_pipe, (uint8_t *)WIFI_MEM_BUFF,USART2_BUFF_SIZE);

	wifi_pipe_enable = 1;

	{
		uint8_t timerout = 0;
		//发送AT测试指令,如果AT测试失败10s后退出WiFi初始化
		while(WIFI_RTL8710_Test_Startup() != WIFI_SUCCESS)
		{
			timerout++;
			if(timerout > 10)
			{
				#ifdef WIFI_DEBUG_INFO
				printf(" WIFI RTL8710 Init ERROR!!\r\n");
				#endif
//				return;
				break;
			}
			WIFI_RTL8710_Delay_ms(1000);
		}
	}

	// 1.close all connection
	WIFI_RTL8710_CloseAll_Connection();

	WIFI_RTL8710_Scan_Router();

	// 3.connect to AP
	#if 0
//	Set_RTL8710_Work_mode(WIFI_MODE_STA);
	{
		uint8_t timerout = 0;
//		while(WIFI_RTL8710_Connect_AP("Orz","SZfs2016") != WIFI_SUCCESS)
		while(WIFI_RTL8710_Connect_AP("TP-LINK_dfq","wrw112358") != WIFI_SUCCESS)
		{
			timerout++;
			if(timerout > 3)
			{
				#ifdef WIFI_DEBUG_INFO
				printf(" WIFI RTL8710 Connect AP ERROR!!\r\n");
				#endif
				return;
			}
			WIFI_RTL8710_Delay_ms(100);
		}
	}
	
	#else
wifi_connect:
	if(WIFI_RTL8710_SmartConfig_Setup_Connect() == WIFI_SUCCESS)
	{
		printf("WIFI_RTL8710_SmartConfig_Setup_Connect success\r\n");
	}
	else
	{
		printf("WIFI_RTL8710_SmartConfig_Setup_Connect filed\r\n");
		WIFI_RTL8710_Delay_ms(1000);
		WIFI_RTL8710_Delay_ms(1000);
		goto wifi_connect;
	}
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	WIFI_RTL8710_Delay_ms(1000);
	
	WIFI_RTL8710_Info(&wifi_info);
	
	#ifdef WIFI_DEBUG_INFO
	printf(" AP SSID : %s\r\n",wifi_info.ap_ssdi);
	printf(" AP password : %s\r\n",wifi_info.ap_password);
	printf(" AP MAC : %s\r\n",wifi_info.mac_addr);
	printf(" AP gatewayip : %s\r\n",wifi_info.gatewayip);
	printf(" AP ipaddr : %s\r\n",wifi_info.ipaddr);
	#endif
	
	#endif
	while(1);

//	WIFI_RTL8710_Check_NetWork_Status();

	WIFI_RTL8710_Ping("192.168.1.1");

	// 4.creater TCP client,single connection
	#if 0
	{
		uint8_t timerout = 0;
		while(WIFI_RTL8710_Set_TCPClient_Mode("192.168.1.109,60000") != WIFI_SUCCESS)
		{
			timerout++;
			if(timerout > 3)
			{
				#ifdef WIFI_DEBUG_INFO
				printf(" WIFI RTL8710 Connect AP ERROR!!\r\n");
				#endif
				return;
			}
			WIFI_RTL8710_Delay_ms(100);
		}
	}

	printf("==========================\r\n");

	// 2.enable transparent transmission mode
	WIFI_RTL8710_Enable_TransparentTransmission_mode();
	#endif
	//6.Enter transmission mode
//	WIFI_RTL8710_Enter_Transmission_mode();
	

//	while(1)
//	{
//		WIFI_RTL8710_Send_data("Hello World!!\r\n");
//		delay_ms(1000);
//		delay_ms(1000);
//	}
}

